PLSCO/Glowduino_Mac/Glowduino.app/Contents/Java/hardware/teensy/avr/boards.txt
menu.usb=USB Type
menu.speed=CPU Speed
menu.opt=Optimize
menu.keys=Keyboard Layout

glowdeck.name=Glowdeck V1
glowdeck.upload.protocol=halfkay
glowdeck.upload.maximum_size=259840
glowdeck.upload.maximum_ram_size=65536
glowdeck.upload.tool=GlowdeckUp
glowdeck.upload.speed=12000000
glowdeck.build.board=glowdeck
glowdeck.build.core=glowdeck
glowdeck.upload.disable_flushing=false
glowdeck.bootloader.path=undefined
glowdeck.build.mcu=mk20dx256
glowdeck.build.warn_data_percentage=97
glowdeck.build.toolchain=arm/bin/
glowdeck.build.command.gcc=arm-none-eabi-gcc
glowdeck.build.command.g++=arm-none-eabi-g++
glowdeck.build.command.ar=arm-none-eabi-ar
glowdeck.build.command.objcopy=arm-none-eabi-objcopy
glowdeck.build.command.objdump=arm-none-eabi-objdump
glowdeck.build.command.size=arm-none-eabi-size
glowdeck.build.flags.common=-g -Wall -ffunction-sections -fdata-sections -nostdlib
glowdeck.build.flags.dep=-MMD
glowdeck.build.flags.optimize=-Os
glowdeck.build.flags.cpu=-mthumb -mcpu=cortex-m4 -fsingle-precision-constant
glowdeck.build.flags.defs=-D__MK20DX256__ -DGLOWDECK=131
glowdeck.build.flags.cpp=-fno-exceptions -felide-constructors -std=gnu++0x -fno-rtti
glowdeck.build.flags.c=
glowdeck.build.flags.S=-x assembler-with-cpp
glowdeck.build.flags.ld=-Wl,--gc-sections,--relax,--defsym=__rtc_localtime={extra.time.local} "-T{build.core.path}/mk20dx256msd.ld"
glowdeck.build.flags.libs=-larm_cortexM4l_math -lm
glowdeck.serial.restart_cmd=true 
glowdeck.serial.safe_baud_rates_only=true
glowdeck.upload.avrdude_wrapper=GlowdeckUp
glowdeck.build.dependency=true
#glowdeck.build.noarchive=true
glowdeck.build.elide_constructors=true
glowdeck.build.gnu0x=true

glowdeck.menu.usb.serial=Serial
glowdeck.menu.usb.serial.build.usbtype=USB_SERIAL
glowdeck.menu.usb.keyboard=Keyboard
glowdeck.menu.usb.keyboard.build.usbtype=USB_KEYBOARDONLY
glowdeck.menu.usb.keyboard.fake_serial=teensy_gateway
glowdeck.menu.usb.touch=Keyboard + Touch Screen
glowdeck.menu.usb.touch.build.usbtype=USB_TOUCHSCREEN
glowdeck.menu.usb.touch.fake_serial=teensy_gateway

#glowdeck.menu.usb.hidtouch=Keyboard + Mouse + Touch Screen
#glowdeck.menu.usb.hidtouch.build.usbtype=USB_HID_TOUCHSCREEN
#glowdeck.menu.usb.hidtouch.fake_serial=teensy_gateway
#glowdeck.menu.usb.hid=Keyboard + Mouse + Joystick
#glowdeck.menu.usb.hid.build.usbtype=USB_HID
#glowdeck.menu.usb.hid.fake_serial=teensy_gateway
#glowdeck.menu.usb.serialhid=Serial + Keyboard + Mouse + Joystick
#glowdeck.menu.usb.serialhid.build.usbtype=USB_SERIAL_HID
#glowdeck.menu.usb.midi=MIDI
#glowdeck.menu.usb.midi.build.usbtype=USB_MIDI
#glowdeck.menu.usb.midi.fake_serial=teensy_gateway
#glowdeck.menu.usb.serialmidi=Serial + MIDI
#glowdeck.menu.usb.serialmidi.build.usbtype=USB_MIDI_SERIAL
#glowdeck.menu.usb.audio=Audio
#glowdeck.menu.usb.audio.build.usbtype=USB_AUDIO
#glowdeck.menu.usb.audio.fake_serial=teensy_gateway
#glowdeck.menu.usb.serialmidiaudio=Serial + MIDI + Audio
#glowdeck.menu.usb.serialmidiaudio.build.usbtype=USB_MIDI_AUDIO_SERIAL
#glowdeck.menu.usb.rawhid=Raw HID
#glowdeck.menu.usb.rawhid.build.usbtype=USB_RAWHID
#glowdeck.menu.usb.rawhid.fake_serial=teensy_gateway
#glowdeck.menu.usb.flightsim=Flight Sim Controls
#glowdeck.menu.usb.flightsim.build.usbtype=USB_FLIGHTSIM
#glowdeck.menu.usb.flightsim.fake_serial=teensy_gateway
#glowdeck.menu.usb.flightsimjoystick=Flight Sim Controls + Joystick
#glowdeck.menu.usb.flightsimjoystick.build.usbtype=USB_FLIGHTSIM_JOYSTICK
#glowdeck.menu.usb.flightsimjoystick.fake_serial=teensy_gateway
glowdeck.menu.usb.everything=All of the Above
glowdeck.menu.usb.everything.build.usbtype=USB_EVERYTHING
glowdeck.menu.usb.disable=No USB
glowdeck.menu.usb.disable.build.usbtype=USB_DISABLED

#uncomment these if you want to try faster overclocking
glowdeck.menu.speed.96=96 MHz reduce code size (overclock)
glowdeck.menu.speed.48=48 MHz reduce code size
glowdeck.menu.speed.24=24 MHz reduce code size
glowdeck.menu.speed.96.build.fcpu=96000000
glowdeck.menu.speed.96.build.flags.optimize=-Os
glowdeck.menu.speed.96.build.flags.ldspecs=--specs=nano.specs
glowdeck.menu.speed.48.build.fcpu=48000000
glowdeck.menu.speed.48.build.flags.optimize=-Os
glowdeck.menu.speed.48.build.flags.ldspecs=--specs=nano.specs
glowdeck.menu.speed.24.build.fcpu=24000000
glowdeck.menu.speed.24.build.flags.optimize=-Os
glowdeck.menu.speed.24.build.flags.ldspecs=--specs=nano.specs

glowdeck.menu.keys.en-us=US English
glowdeck.menu.keys.en-us.build.keylayout=US_ENGLISH
glowdeck.menu.keys.fr-ca=Canadian French
glowdeck.menu.keys.fr-ca.build.keylayout=CANADIAN_FRENCH
glowdeck.menu.keys.xx-ca=Canadian Multilingual
glowdeck.menu.keys.xx-ca.build.keylayout=CANADIAN_MULTILINGUAL
glowdeck.menu.keys.cz-cz=Czech
glowdeck.menu.keys.cz-cz.build.keylayout=CZECH
glowdeck.menu.keys.da-da=Danish
glowdeck.menu.keys.da-da.build.keylayout=DANISH
glowdeck.menu.keys.fi-fi=Finnish
glowdeck.menu.keys.fi-fi.build.keylayout=FINNISH
glowdeck.menu.keys.fr-fr=French
glowdeck.menu.keys.fr-fr.build.keylayout=FRENCH
glowdeck.menu.keys.fr-be=French Belgian
glowdeck.menu.keys.fr-be.build.keylayout=FRENCH_BELGIAN
glowdeck.menu.keys.fr-ch=French Swiss
glowdeck.menu.keys.fr-ch.build.keylayout=FRENCH_SWISS
glowdeck.menu.keys.de-de=German
glowdeck.menu.keys.de-de.build.keylayout=GERMAN
glowdeck.menu.keys.de-dm=German (Mac)
glowdeck.menu.keys.de-dm.build.keylayout=GERMAN_MAC
glowdeck.menu.keys.de-ch=German Swiss
glowdeck.menu.keys.de-ch.build.keylayout=GERMAN_SWISS
glowdeck.menu.keys.is-is=Icelandic
glowdeck.menu.keys.is-is.build.keylayout=ICELANDIC
glowdeck.menu.keys.en-ie=Irish
glowdeck.menu.keys.en-ie.build.keylayout=IRISH
glowdeck.menu.keys.it-it=Italian
glowdeck.menu.keys.it-it.build.keylayout=ITALIAN
glowdeck.menu.keys.no-no=Norwegian
glowdeck.menu.keys.no-no.build.keylayout=NORWEGIAN
glowdeck.menu.keys.pt-pt=Portuguese
glowdeck.menu.keys.pt-pt.build.keylayout=PORTUGUESE
glowdeck.menu.keys.pt-br=Portuguese Brazilian
glowdeck.menu.keys.pt-br.build.keylayout=PORTUGUESE_BRAZILIAN
glowdeck.menu.keys.rs-rs=Serbian (Latin Only)
glowdeck.menu.keys.rs-rs.build.keylayout=SERBIAN_LATIN_ONLY
glowdeck.menu.keys.es-es=Spanish
glowdeck.menu.keys.es-es.build.keylayout=SPANISH
glowdeck.menu.keys.es-mx=Spanish Latin America
glowdeck.menu.keys.es-mx.build.keylayout=SPANISH_LATIN_AMERICA
glowdeck.menu.keys.sv-se=Swedish
glowdeck.menu.keys.sv-se.build.keylayout=SWEDISH
glowdeck.menu.keys.tr-tr=Turkish (partial)
glowdeck.menu.keys.tr-tr.build.keylayout=TURKISH
glowdeck.menu.keys.en-gb=United Kingdom
glowdeck.menu.keys.en-gb.build.keylayout=UNITED_KINGDOM
glowdeck.menu.keys.usint=US International
glowdeck.menu.keys.usint.build.keylayout=US_INTERNATIONAL

teensy36.name=Teensy 3.6
teensy36.upload.maximum_size=1048576
teensy36.upload.maximum_data_size=262144
teensy36.upload.tool=teensyloader
teensy36.upload.protocol=halfkay
teensy36.build.board=TEENSY36
teensy36.build.core=teensy3
teensy36.build.mcu=mk66fx1m0
teensy36.build.warn_data_percentage=99
teensy36.build.toolchain=arm/bin/
teensy36.build.command.gcc=arm-none-eabi-gcc
teensy36.build.command.g++=arm-none-eabi-g++
teensy36.build.command.ar=arm-none-eabi-gcc-ar
teensy36.build.command.objcopy=arm-none-eabi-objcopy
teensy36.build.command.objdump=arm-none-eabi-objdump
teensy36.build.command.size=arm-none-eabi-size
teensy36.build.flags.common=-g -Wall -ffunction-sections -fdata-sections -nostdlib
teensy36.build.flags.dep=-MMD
teensy36.build.flags.optimize=-Os
teensy36.build.flags.cpu=-mthumb -mcpu=cortex-m4 -mfloat-abi=hard -mfpu=fpv4-sp-d16 -fsingle-precision-constant
teensy36.build.flags.defs=-D__MK66FX1M0__ -DTEENSYDUINO=134
teensy36.build.flags.cpp=-fno-exceptions -felide-constructors -std=gnu++0x -fno-rtti
teensy36.build.flags.c=
teensy36.build.flags.S=-x assembler-with-cpp
teensy36.build.flags.ld=-Wl,--gc-sections,--relax,--defsym=__rtc_localtime={extra.time.local} "-T{build.core.path}/mk66fx1m0.ld"
teensy36.build.flags.libs=-larm_cortexM4lf_math -lm
teensy36.serial.restart_cmd=false

